def start_game():
    print("Добро пожаловать в игру!")
    print("Вы - подросток по имени Амелия.  Все ваши дальнейшие действия влияют на исход игры. ")
    print("Вы можете покинуть свою родную деревню и уехать в большой город, чтобы начать новую жизнью,")
    print("Либо остаться на родине, чтобы продолжать нести ценности своей семьи и жить в месте, которое любишь больше всего на свете.")
    print("--------------------------------------------------------------------------------------------------------------------------")
    print("                                                                                                                          ")
    print("Вот уже несколько лет молодая красивая девушка живет в Бостване, в городе куда она с родителями переехала, когда ей было 8 лет.")
    print("Ee родители были учеными, и они переехали в эту прекрасную страну, чтобы изучать ее удевительную природу. С самого детства")
    print("Амелия была окружена богатым разнообразием животного и растительного мира, и она полюбила эту природу всей душой")
    print("                                                                                                                          ")
    print("Каждый день Амелия проводила время на прогулках по саваннам, наблюдая за слонами, жирафами и другими животными, обитающими ")
    print("в ближайших окрестностях. Особое внимание привлекали к себе львы, грозные, опасные, но безумно красивые и свободные животные.")
    print("Она узнавала о них все больше и больше, и ее любовь к природе только усиливалась. Однажды, как обычно прогуливаясь по окраине")
    print("саванны, в далеке она заметила прайд диких львов охотившихся на бедных антилоп. Находиться рядом с прайдом в такие моменты ")
    print("очень опасно, но переборов страх и немного задержавшись на расстоянии, можно остаться с самыми запоминающимися впечатлениями")
    print("в вашей жизни. Стая маленьких львят под покровительством их сильных родителей учатся выживать, охотясь на нелегкую добычу.")
    print("Удивительно - подумала Амелия. - с каким рвением они стараются догнать животное, и с каким довольным рычанием они играются")
    print("с добычей.")
    print("Недалеко от себя, девушка услышала шорох, от чего Амелия, испугавшись, взвигнула и обернулась назад. К счастью это оказался ")
    print("не какое нибудь опасное животное, а Ильдар - человек, с которым они дружат уже более 9 лет. -Ты меня очень испугал - проговорила")
    print("Амелия, - перестань так тихо подкрадываться ко мне, особенно, когда мы в саванне. - Больше так не буду, но ты бы видела свое")
    print("испуганное лицо в этот момент - тихо посмеиваясь сказал Ильдар. - Вообще я пришел рассказать новости. - Ильдар любитель сплетен ")
    print("как и все жители в этом маленьком городке, ни одна история или новость не остается в тайне, по крайней мере больше одного дня.")
    print("На увивление в этот раз Ильдар прошел большое расстояние от дома до Амелии, чтобы рассказать новость. Девушка сразу поняла, что")
    print("новость очень важная.- Ко мне скоро приезжает кузина, как только узнал, сразу побежал к тебе рассказывать радостную новость.")
    print("Я е так давно не видел, она такая замечательная, тебе она сразу понравится, вот увидишь. Как только приедет я тебя с ней ")
    print("познакомлю. - с улыбкой на лице рассказал Ильдар. Амелия сразу же обрадовалась этой новости, ведь она так давно хотела ее поближе")
    print("узнать. Девушка видела ее только на фотографиях: безумно красивая женщина, с завораживающей улыбкой. Ильдар всегда с теплотой ")
    print("отзывался о ней, постоянно рассказывая о ее приключениях, которые она описывала в своих письмах. Это все производило ощущение   ")
    print("что его кузина неимоверно интересный, сильный духом человек. Амелия в каком то смысле хотела быть похожей на нее. ")
    print("- Это прекрасная новость! - обнимая за плечи своего друга, радостно воскликнула Амелия. - Мне срочно нужно домой, хочу подготовить ")
    print("для нее какой нибудь подарок. Ильдар кивнув и взяв Амелию под руку направился к городу. В течении получаса они дошли до дома девушки ")
    print("и попрощались, перекинувшись под конец шутками о истории, которую они обсуждали по дороге домой.")
    print("На пороге Амелию встретил отец,который предупредил, что у них дома гости,  а именно их новый молодой коллега по имени Саид.")
    print(" ")
        
    print("Мужчина приехал сюда для изучения алмазных копей, что означало его долгое проживание в бостване. Саид выглядел довольно привлекательным,")
    print("умным, веселым мужчиной. От чегоу Амелии с Саидом сразу же завязался разговор о его работе и планах на жизнь. Оказалось что у них много")
    print("общего, и самое главное Саид так же сильно влюбился в Боствану, ее саванны и людей проживающих в ней, как и Амелия, этот важный факт")
    print("еще больше сплотил их двоих. Когда речь пошла про истории чудесного города, Саид поведал девушке историю о древнем артефакте, что тот")
    print("собирается отыскать в ходе работы. Находится он в алмазных долинах, куда очень трудно добраться и очень легко потеряться. ")

    print(" Они проговорили до позднего вечера, пока у обоих не начали слипаться глаза от усталости. Решив все таки направиться спать, ")
    print("новоизбранные друзья разошлись по своим комнатам. Амелия пред сном решила просмотреть свою коллекцию фотографий животных и растений")
    print("саванны, чтобы выбрать самые красивые в подарок кузине Ильдара. Новые фотографии львиного прайда и ярких Ару отлично подходили для подарка")
    print("  ")

    print("Проснувшись утром от маленького волнения, девушка начала собираться в гости и не забыв прихватить подарок направилась к дому Ильдара.")
    print("Пару минут спустя, девушка подошла к большому дому отделанному белой штукатуркой и оранжевой крышей. Из дома доносились звуки непринужденной")
    print("музыки и запах свежеиспеченого печенья. Ильдар,заметив девушку возле дома, пошел ее встречать. Дверь распахнулась и тела молодых людей обдало")
    print("приятной прохладой, что так не хватает в горячей Бостване. У входа стояла  высокая светловолосая девушка, которая по-доброму улыбалась")
    print("своей госте. - меня зовут Одри, приятно познакомиться) - нежным голосом проговорила та ")
    print("Одри была загадочной и независимой девушкой, своим приездом она привлекла все внимание Амелии своей необычностью и приключенческим духом. ")
    print("С самого начала девушки начали ладить, рассказ за рассказом и Амелия все больше понимала насколько удивительной жизнью живет Одри.")
    print("Девушка заметила какой огонь горит в глазах Одри, когда она рассказывает о своих путешествиях по миру. Ей казалось что она была везде!")
    print("Одри побывала во всех континентах, от северного полина до южного, в маленьких деревнях и огромных мегополисах")

    print("Такой интерес к жизни заставил бы любого человека хотеть поступить так же как Одри и поехать путешествовать по миру. Амелии это казалось")
    print("очень заманчивой перспективой, что не скажешь про Ильдара. Он же,в отличии от кузины, любил находится дома, вкругу своей семьи. Вы наверно")
    print("еще не встречали большего семьянина чем он.А вообще у него был особый дар, что не давал ему шанса жить где то помимо Бостваны: он умел")
    print("приручать диких львов. Однажды в детстве к ним забрел маленький львенок с почти белоснежной шкурой. Если бы не Ильдар, этого львенка")
    print("больше бы не было-люди слишком бояться львов в доме. Но сейчас большой и гордый вожак прайда, по имени Борей, ходит по своим окрестностям")
    print("и ждет своего хозяина для кошачьей ласки. Ильдар любит Борея как своего сына, хотя в каком то смысле он и есть его сын. Парень сам его вырастил")
    print("и подчинил себе, а с ним и всех остальных в прайде.")
    print("За несколько дней общения с Одри, Саидом и Ильдаром, Амелии успели предложить отправиться с Одри в большое путешетвие по миру, исследовать новые места ")
    print("и погрузиться в разные культуры. Она может отправиться вместе с Саидом на поиски древних артефактов. А так же полностью погрузится в дикую,девственную ") 
    print("атмосферу саванны вместе с Ильдаром, продолжив хранить семейныее ценности и жить в безумно любимой Бостване.")
    print("  ")
    print("")
    print("Ваше решение: пойти с Одри, Саидом или Ильдаром")




    def main():
         score_dux_cultur = 0
         score_dux_priklucheniy = 0

    choice = user_choice(["Пойти с Одри", "Пойти с Саидом", "Пойти с Ильдаром"])
    if choice == 1:
        sodri()
    elif choice == 2:
        ssaidom()
    else:
        sildarom()

def user_choice(options):
    print("Выберите один из вариантов:")
    for i, option in enumerate(options):
        print(f"{i+1}. {option}")
    while True:
        try:
            choice = int(input("Ваш выбор: "))
            if choice < 1 or choice > len(options):
                print("Пожалуйста, выберите допустимый вариант.")
            else:
                return choice
        except ValueError:
            print("Пожалуйста, введите число.")

def sodri():
    print("Вы решаете присоединиться к путешествию с Одри.")
    print("- Я так рада что у меня теперь будет спутница в путешествиях! - радостно воскрикнула девушка и принялась обнимать свою подругу")
    print("У меня столько идей куда можем поехать! Как на счет Франции или Японии?")

    choice = user_choice(["Франция", "Япония"])
    if choice == 1:
        fransia()
    else:
        iaponia()
 

def user_choice(options):
    print("Выберите один из вариантов:")
    for i, option in enumerate(options):
        print(f"{i+1}. {option}")
    while True:
        try:
            choice = int(input("Ваш выбор: "))
            if choice < 1 or choice > len(options):
                print("Пожалуйста, выберите допустимый вариант.")
            else:
                return choice
        except ValueError:
            print("Пожалуйста, введите число.")

def fransia():
    print("Отлично! направляемся с утра во Францию. Собирай вещи!")
    print("Раннее утро, ожидание рейса, долгий перелет, волнение при посадке, ожидание багажа и... выход из аэропорта. Вот они и во Франции!")
    print("Париж встретил девушек ярким солнцем и дружелюбными людьми. Амелия начала рассматривать все на своем пути, для нее было все в новинку ")
    print("Другие люди, другие запахи, другие здания, другая природа, абсолютно все не такое как в Бостване. Шарм Парижа чувствовался на каждом шагу")
    print("- Итак, куда пойдем? - спросила Одри")

    choice = user_choice(["Погуляем по улицам", "Сходить к Эфелевой башни", "Сходить в Лувр"])
    if choice == 1:
        progylka()
        score_dux_cultur +=1
    elif choice == 2:
        bashna()
        score_dux_cultur +=1
    else:
        luvr()
        score_dux_priklucheniy +=1
    

def user_choice(options):
    print("Выберите один из вариантов:")
    for i, option in enumerate(options):
        print(f"{i+1}. {option}")
    while True:
        try:
            choice = int(input("Ваш выбор: "))
            if choice < 1 or choice > len(options):
                print("Пожалуйста, выберите допустимый вариант.")
            else:
                return choice
        except ValueError:
            print("Пожалуйста, введите число.")

def progylka():
    print("Вы направились гулять по завораживающим улицам Парижа. Запахи вкусной еды и свежей выпечки сопровождали вас на всем пути")
    print("Пройдя несколько миль и вдоволь насладившись калоритом Парижа, девушки решили зайти в кафе, чтобы перекусить и отдохнуть. ")
    print("Как только они присели за стол, к ним подошел управляющий и рассказал, что сегодня каждый посеитель может посмотреть на")
    print("мастер класс от шеф повара и научиться особым секретным рецептам традиционных французских блюд. Девушки с интузиазмом ")
    print("согласились и весь вечер провели в компании их нового знакомого-Сами, шеф повара этого кафе. Теперь девушки умеют готовить")
    print("наивкуснейшие синнабоны и тающие во рту макаруны")
    print(" ")
    print("Вам начислено: 1 балл духа культур")

    print(" - мы пойдем завтра в Лувр или к Эфелевой башне?")
    choice = user_choice([ "Сходить к Эфелевой башне", "Сходить в Лувр","нет, полетели в Японию","полетели домой"])
    if choice == 1:
        bashna()
        score_dux_cultur +=1
    elif choice ==2:
        luvr()
        score_dux_priklucheniy +=1
    elif choice == 3:
        iaponia()
    else:
        home(1)
    
def user_choice(options):
    print("Выберите один из вариантов:")
    for i, option in enumerate(options):
        print(f"{i+1}. {option}")
    while True:
        try:
            choice = int(input("Ваш выбор: "))
            if choice < 1 or choice > len(options):
                print("Пожалуйста, выберите допустимый вариант.")
            else:
                return choice
        except ValueError:
            print("Пожалуйста, введите число.")

def luvr():
    print("Девушки направились к Лувру-одному из самых известных музеев в мире, Лувр одна из визитных карточек Парижа, поэтому побывать")
    print("в нем обязан все, кто хоть раз приехал в Париж. Зайдя в это огромное здание, у Амелии перехватило дух. В Лувре все так красиво!")
    print("Казалось что в Лувре собрали каждую частичку  всех народов и времен, каждого гения, будь то писатель, скульптор или художник")
    print("Все в Лувре заслуживает особого внимания, потому что какими великими трудами все это собиралось. Девушки провели весь день")
    print("гуляя по музею. Под конец дня у них ужасно разболелись ноги и они решили поскорее пойти в квартиру где они остановились.")
    print("Несмотря на то что они очень устали, настроение у девушек было отличное и теперь будет что рассказать своим знакомым")
    print(" ")
    print("Вам начислено: 1 балл духа приключений")

    print(" - куда сходим завтра?")

    choice = user_choice(["Погуляем по улицам", "Сходить к Эфелевой башни","полетели в Японию","полетели домой"])
    if choice == 1:
        progylka()
        score_dux_cultur +=1
    elif choice == 2: 
        bashna()
        score_dux_cultur +=1
    elif choice == 3:
        iaponia()
    else:
        home()

def user_choice(options):
    print("Выберите один из вариантов:")
    for i, option in enumerate(options):
        print(f"{i+1}. {option}")
    while True:
        try:
            choice = int(input("Ваш выбор: "))
            if choice < 1 or choice > len(options):
                print("Пожалуйста, выберите допустимый вариант.")
            else:
                return choice
        except ValueError:
            print("Пожалуйста, введите число.")
        
def bashna():
    print("Девушки направились к самой известной башни в Европе, к Эфелевой башни. Ее изысканный вид ")
    print("заставил девушек подольше остановиться у ее основания и долго рассматривать ее. Амелия")
    print("и Одри присели на лавочку к одному пожилому человеку. Его звали Френсис. Мужчина очень")
    print("интересно рассказывал о истории Франции, а точнее о важных событиях происходивших здесь ")
    print("Френсис был коренным жителем Парижа, всю жизнь проработавшим в полиции, защищая этот чудный")
    print("город от опасностей. Девушки завороженно слушали его и много спрашивали интересующими вопросами")
    print("Френсис после долгих рассказов предложил им пройтись с ним до дома. По дороге старик не умолкая")
    print("выдавал все новые и новые истории, но всему приходит конец, и под вечер возле дома Френсиса")
    print("девушки разошлись с ним, оставляя неизгладимое приятное ощущение после разговора.")
    print("Теперь девушки прочувствовали Францию, и в особенности Париж с точки зрения истории")
    print("Такое впечатление у них останется надолго!")
    print(" ")
    print("Вам начисленно: 1 балл духа культуры")
    print(" ")

    print("- мы пойдем куда то завтра?")

    choice = user_choice(["Погуляем по улицам", "Сходить в Лувр","полетели в Японию","полетели домой"])
    if choice == 1:
        progylka()
        score_dux_cultur +=1
    elif choice ==2:
        luvr()
        score_dux_priklucheniy +=1
    elif choice == 3:
        iaponia()
    else:
        home()
    

def user_choice(options):
    print("Выберите один из вариантов:")
    for i, option in enumerate(options):
        print(f"{i+1}. {option}")
    while True:
        try:
            choice = int(input("Ваш выбор: "))
            if choice < 1 or choice > len(options):
                print("Пожалуйста, выберите допустимый вариант.")
            else:
                return choice
        except ValueError:
            print("Пожалуйста, введите число.")
   


def iaponia():
    print("Отлично! направляемся с утра в Японию. Собирай вещи!")
    print("Раннее утро, ожидание рейса, долгий перелет, волнение при посадке, ожидание багажа и... выход из аэропорта. Вот они и в Японии!")
    print("Токио встретил девушек прекрасной погодой и новыми технологиями. Амелия начала рассматривать все на своем пути, для нее было все в новинку ")
    print("Другие люди, другие запахи, другие здания, другая природа, абсолютно все не такое как в Бостване. Новизна Токио чувствовалась на каждом шагу")
    print("- Итак, куда пойдем? - спросила Одри")

    choice = user_choice(["Погуляем по улицам", "Съездить в Киото"])
    if choice == 1:
        progylkapotk()
        score_dux_priklucheniy +=1
    else:
        kioto()
        score_dux_cultur +=1
    

def user_choice(options):
    print("Выберите один из вариантов:")
    for i, option in enumerate(options):
        print(f"{i+1}. {option}")
    while True:
        try:
            choice = int(input("Ваш выбор: "))
            if choice < 1 or choice > len(options):
                print("Пожалуйста, выберите допустимый вариант.")
            else:
                return choice
        except ValueError:
            print("Пожалуйста, введите число.")

def progylkapotk():
    print("Амелию и Одри сразу утянуло в этот суматошный ритм жизни всех жителей Токио. Все вокруг суетятся, спешат, но все же")
    print("остались некоторые люди спокойно прогуливающиеся по улицам или ходящие по магазинам. Побывав в Японии просто нельзя")
    print("пройти мимо из традиционных блюд. Например суши, до чего они великолепно приготовлены тут! Девушки за обе щеки")
    print("стали их уминать, сидя в красивом ресторане морской пищи с видом на Токийский залив. Вода контрастом выбивает из")
    print("шумного мегаполиса в тихие прибрежные районы, наполненные своим калоритом. Полностью насладившись видом современного")
    print("Токио, подруги решили зайти в клуб, откуда до позней ночи не выходили. Рарядившись энергией музыки и хорошим настроением")
    print("Амелия и Одри с легкой усталостью направились домой, но этот день запомнится им надолго, ведь контрасный вид Токио")
    print("заслуживает особого внимания.")
    print(" ")
    print("Вам начисленно: 1 балл духа приключений.")
    print(" ")

    print("Куда направимся завтра?")
    print(" ")
    choice = user_choice(["Съездить в Киото","полетели во Францию","полетели домой"])
    if choice == 1:
       kioto()
       score_dux_cultur +=1
    elif choice == 2:
        fransia()
    else:
        home()
    
def user_choice(options):
    print("Выберите один из вариантов:")
    for i, option in enumerate(options):
        print(f"{i+1}. {option}")
    while True:
        try:
            choice = int(input("Ваш выбор: "))
            if choice < 1 or choice > len(options):
                print("Пожалуйста, выберите допустимый вариант.")
            else:
                return choice
        except ValueError:
            print("Пожалуйста, введите число.")

def kioto():
    print("Чтобы прочувствовать всю глубину истории Японии, турестические агенства предлагают посетить города, дающие понятие")
    print("о вере японцев, их культуре и традициях. Один из таких городов: Киото, куда и направились девочки. В Киото ")
    print("находятся множество красивых буддистских храмов и садов. Этот город одно сплошное святилище для верующих,")
    print("и тех кто очень хочет узнать всю культуру древней и современной Японии. Амелия и Одри встретили еще на остановке")
    print("пожилую пару, которая с радостью показала достопремичательности Киото. После чего они пригласили девушек к себе домой ")
    print("угощая их очень вкусным чаем с традиционными японскими сладостями. Проведя весь день в умиротворении и спокойствии")
    print("подруги направились к себе домой.")
    print(" ")
    print("Вам начислено: 1 балл души культуры")
    print(" ")
    print("-куда направимся завтра?")

    choice = user_choice(["Погуляем по улицам","полетели во Францию","полетели домой" ])
    if choice == 1:
        progylkapotk()
        score_dux_priklucheniy +=1
    elif choice == 2:
        fransia()
    else:
        home()

def user_choice(options):
    print("Выберите один из вариантов:")
    for i, option in enumerate(options):
        print(f"{i+1}. {option}")
    while True:
        try:
            choice = int(input("Ваш выбор: "))
            if choice < 1 or choice > len(options):
                print("Пожалуйста, выберите допустимый вариант.")
            else:
                return choice
        except ValueError:
            print("Пожалуйста, введите число.")


def home():
    print("Амелия с большим интузиазмом следовала за Одри, по окончанию путешествия, они возвращались домой полные впечатлений ")
    print("и удивительных историй. Амелия поняла что путешествия это не только возможность увидеть новые места, но и расширить ")
    print("свой кругозор, встретить много интересных людей. Девушки еще обязательно встретятся в новых странах, будут покорять")
    print("горные вершины, плавать на яхтах по океану, посещать далекие страны. На этом пути Амелия осознала, что настоящая любовь")
    print(" может быть найдена в свободе и приключениях")
    print(" ")
    print(" ..The end..")
    print(f"Ваши баллы за приключения: {score_dux_priklucheniy} баллов духа приключений")
    print(f"                           {score_dux_cultur} баллов духа культуры")
    



def ssaidom():
    print("Ваше путешествие начинается...")
    print("ну,я бы дописала,если бы было больше времени и воображения")

def sildarom():
    print("ну, я бы дописала")

start_game()



